#Задание 1
#Поработайте с переменными, создайте несколько, выведите на экран. 
#Запросите у пользователя некоторые числа и строки и сохраните в переменные, 
#затем выведите на экран.

a = 7
print ('a= %d' % (a))
print ('Введите имя:')
b=input ()
print ('Введите возраст:')
c= int(input())
print (f"Привет, {b}!")
print (f"Твой возраст: {c}!")
